/*******************************************************************************
** 文件名称 : usart.h
** 软件版本 : 1.0
** 编译环境 : RealView MDK-ARM 4.20
** 文件作者 : 	
** 功能说明 : 在该文件中包含程序需要用到的头文件
**
**                       (c) Copyright 2007-2012, viewtool
**                            http://www.viewtool.com
**                               All Rights Reserved
**
*******************************************************************************/
/* 防止重定义-----------------------------------------------------------------*/
#ifndef _USART1_H
#define _USART1_H
/* 包含头文件 *****************************************************************/

/* 类型声明 ------------------------------------------------------------------*/
/* 宏定义 --------------------------------------------------------------------*/    
/* 变量 ----------------------------------------------------------------------*/
/* 函数声明 ------------------------------------------------------------------*/
/* 函数定义 ------------------------------------------------------------------*/
#ifdef   USART1_globals
#define  USART1_ext
#else
#define  USART1_ext  extern
#endif



USART1_ext u8 RX_Mark1,Rx1InterruptFlag,TimerRx1Count;
//            接收结束标志, 串口中断标志，  定时计数
//USART1_ext u8 TX_Mark1,Tx1InterruptFlag,TimerTx1Count;
//            发送结束标志, 串口中断标志，  发送定时计数
//USART1_ext u8 USART1_SEND_DATA[256],USART1_RECEIVE_DATA[256];

USART1_ext void Usart1_Configuration(u32 baud,u16 UsartParity);//串口1初始化，baud输入波特率，UsartParity为是否效验
USART1_ext void Rts1485(u8 bit);//控制485


#endif /*_usart_H*/
